In [35]:
import pandas as pd

df = pd.read_excel("team.xlsx")

df.head(5)  # 头五行

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24  64
1   Arry    C  36  37  37  57
2    Ack    A  57  60  18  84
3  Eorge    C  93  96  71  78
4    Oah    D  65  49  61  86

In [ ]:
df.shape  # (100, 6) 查看行数和列数

In [27]:
df.info()  # 查看索引、数据类型和内存信息

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    100 non-null    object
 1   team    100 non-null    object
 2   Q1      100 non-null    int64
 3   Q2      100 non-null    int64
 4   Q3      100 non-null    int64
 5   Q4      100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB

In [28]:
df.describe()  # 查看数值型列的汇总统计

               Q1          Q2          Q3          Q4
count  100.000000  100.000000  100.000000  100.000000
mean    49.200000   52.550000   52.670000   52.780000
std     29.962603   29.845181   26.543677   27.818524
min      1.000000    1.000000    1.000000    2.000000
25%     19.500000   26.750000   29.500000   29.500000
50%     51.500000   49.500000   55.000000   53.000000
75%     74.250000   77.750000   76.250000   75.250000
max     98.000000   99.000000   99.000000   99.000000

In [29]:
df.dtypes  # 查看各字段类型

name    object
team    object
Q1       int64
Q2       int64
Q3       int64
Q4       int64
dtype: object

In [30]:
df.axes  # 显示数据行和列名

[RangeIndex(start=0, stop=100, step=1),
 Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')]

In [31]:
df.columns  # 列名

Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')

In [ ]:
df.set_index("name", inplace=True)
# 建立缩影并生效

In [49]:
df[["Q1", "Q3"]]
df.Q1

name
Liver       89
Arry        36
Ack         57
Eorge       93
Oah         65
            ..
Gabriel     48
Austin7     21
Lincoln4    98
Eli         11
Ben         21
Name: Q1, Length: 100, dtype: int64

In [ ]:
# 选择多列
df[["team", "Q1"]]
# 只看这两列,注意括号
df.loc[:, ["team", "Q1"]]  # 和上一行效果一样

In [5]:
(df.shape)

NameError: name 'df' is not defined